Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: When you’re applying patches, you can ask Git to warn you if it’s applying patches with the specified whitespace issues:
es: Al incorporar parches, puedes pedirle a Git que te avise específicamente sobre determinados problemas de espaciado:

source: If you run `chmod u+x .git/hooks/update`, which is the file you into which you should have put all this code, and then try to push a non-fast-forwarded reference, you get something like this:
es: Si lanzas el comando 'chmod u+x .git/hooks/update', siendo este el archivo donde has puesto todo este código; y luego intentas enviar una referencia que no sea de avance-rápido, obtendrás algo como esto:

source: Tracking branches are local branches that have a direct relationship to a remote branch.
es: Las ramas de seguimiento son ramas locales que tienen una relación directa con alguna rama remota.

source: After you exit the merge tool, Git asks you if the merge was successful.
es: Tras salir de la herramienta de fusionado, Git preguntará a ver si hemos resuelto todos los conflictos y la fusión ha sido satisfactoria.

source: Let’s add the rest of the team.
es: Vamos a añadir al resto del equipo.

source: Subversion importing interface.
es: El interface de importación desde Subversion.

source: You can run via SSH in the same manner as the `receive-pack` process.
es: Se puede lanzar a través de SSH, de la misma forma que se arrancaba el proceso `receive-pack`.

source: There are different ways to initiate the `upload-pack` process on the remote repository.
es: Hay varias maneras de iniciar un proceso `upload-pack` en el repositorio remoto.

source: The trick is finding that latest commit SHA — it’s not like you’ve memorized it, right?
es: El problema es cómo localizarla, --porque, ¿no te la sabrás de memoria, no?--.

source: At this point, you can exit the interactive adding script and run `git commit` to commit the partially staged files.
es: En este punto, es posible salir del script interactivo y lanzar el comando 'git commit' para almacenar esa confirmación de cambios parciales en los archivos.

source: Often, you’ll do this to make sure your commits apply cleanly on a remote branch — perhaps in a project to which you’re trying to contribute but that you don’t maintain.
es: Habitualmente, optarás por esta vía cuando quieras estar seguro de que tus confirmaciones de cambio (commits) se pueden aplicar limpiamente sobre una rama remota; posiblemente, en un proyecto donde estés intentando colaborar, pero lleves tu el mantenimiento.

source: Here’s what it looks like:
es: Tiene un aspecto como este:

source: The SHA-1 value of all '0's means that nothing was there before — because you’re adding the experiment reference.
es: Una clave SHA-1 con todo '0's, nos indica que no habia nada anteriormente, y que, por tanto, estamos añadiendo una nueva referencia.

source: ### Small Setups ###
es: ### Pequeños despliegues ###

source: There are ways to get around this (namely, stashing and commit amending) that we’ll cover later.
es: Y, para ello, tenemos algunos procedimientos (stash y commit ammend), que vamos a ver más adelante.

source: It’s often helpful to get a review of all the commits that are in this branch but that aren’t in your master branch.
es: Suele ser util revisar todas las confirmaciones de cambios (commits) que esten es esta rama, pero no en tu rama principal.

source: Branch pointing into the commit data’s history.
es: Apuntadores en el registro de confirmaciones de una rama.

source: Let’s say you have a Git server on your network at `git.ourcompany.com`.
es: Supongamos que tienes un sevidor Git en tu red, en 'git.ourcompany.com'.

source: John has a reference to the changes Jessica pushed up, but he has to merge them into his own work before he is allowed to push:
es: John tiene una referencia a los cambios enviados por Jessica, pero ha de fusionarlos en su propio trabajo antes de que se le permita enviar:

source: The issue with including the library is that it’s difficult to customize the library in any way and often more difficult to deploy it, because you need to make sure every client has that library available.
es: La problemática en el primer caso radica en la dificultad de personalizar la biblioteca compartida. Y en la dificultal para su despliegue; ya que es necesario que todos y cada uno de los clientes dispongan de ella.

source: At the end of this list, it writes "done" to initiate the `upload-pack` process to begin sending the packfile of the data it needs:
es: Llegando al final de la lista, escribe "done" (hecho). Para indicar al proceso `upload-pack` que ya puede comenzar a enviar el archivo empaquetado con los datos requeridos:

source: The `prepare-commit-msg` hook is run before the commit message editor is fired up but after the default message is created.
es: El punto de enganche 'prepare-commit-msg' se activa antes de arrancar el editor del mensaje de confirmación de cambios, pero después de crearse el mensaje por defecto.

source: If you do an initial `submodule update`, commit in that submodule directory without creating a branch to work in, and then run `git submodule update` again from the superproject without committing in the meantime, Git will overwrite your changes without telling you.
es: Si se realiza un `submodule update` inicial, se hacen cambios y se confirman en esa carpeta de submódulo sin haber creado antes una rama en la que trabajar. Y si, tras esto, se realiza de nuevo un `git submodule update` desde el proyecto padre, sin haber confirmado cambios en este, Git sobreescribirá cambios sin aviso previo.

source: GitHub administration page.
es: Página de administración GitHub.

source: You add external projects as submodules with the `git submodule add` command:
es: Los proyectos externos se pueden incluir como submódulos mediante el comando `git submodule add`:

source: Git gives you the name of the nearest tag with the number of commits on top of that tag and a partial SHA-1 value of the commit you’re describing:
es: Git te dará el nombre de la etiqueta más cercana, mas el número de confirmaciones de cambios entre dicha etiqueta y la confirmación que estas describiendo, más una parte de la firma SHA-1 de la confirmación:

source: You’ll determine the path of the object you want to write out (the first two characters of the SHA-1 value being the subdirectory name, and the last 38 characters being the filename within that directory).
es: Para fijar el lugar donde almacenarlo, utilizaremos como nombre de carpeta los dos primeros caracteres del valor SHA-1 y como nombre de archivo los restantes 38 caracteres de dicho valor SHA-1.

source: Insert 18333fig0502.png Figure 5-2.
es: Insert 18333fig0502.png Figura 5-2.

source: Then, it adds a space followed by the size of the content and finally a null byte:
es: Después añade un espacio, seguido del tamaño del contenido y termina con un byte nulo:

source: It’s pushed and pulled with the rest of your project.
es: Y será enviado (push) y recibido (pull) junto con el resto del proyecto.

source: This is especially important to understand if you’re used to Subversion, because you’ll notice that the two developers didn’t edit the same file.
es: Entender bien esto es especialmente importante, sobre todo si estás acostumbrado a utilizar Subversion; porque habrás notado que ambos desarrolladores han editado archivos distintos.

source: Another very frequent use of this syntax is to see what you’re about to push to a remote:
es: Otra utilidad habitual de estas sentencias es la de ver lo que se está a punto de enviar a un repositorio remoto:

source: At this point, you can go back to the master branch and do a fast-forward merge (see Figure 3-30).
es: En este momento, puedes volver a la rama 'master' y hacer una fusión con avance rápido (fast-forward merge). (ver Figura 3-30)

source: A cherry-pick in Git is like a rebase for a single commit.
es: Entresacar (cherry-pick) en Git es como reorganizar (rebase) una sola confirmación de cambios (commit).

source: When you do the submodule update a second time, it will still revert your work, but at least you have a pointer to get back to.
es: Cuando se realice una actualización (update) del submódulo por segunda vez, se seguirá sobreescribiendo el trabajo; pero al menos se tendrá un apuntador para volver hasta los cambios realizados.

source: If you’re interested in using the HTTP-push protocols, you can read about preparing a repository for this purpose at `http://www.kernel.org/pub/software/scm/git/docs/howto/setup-git-server-over-http.txt`.
es: Si estás interesado en utilizar los protocolos HTTP-push, puedes encotrar más información en `http://www.kernel.org/pub/software/scm/git/docs/howto/setup-git-server-over-http.txt`.

source: If you run `git gc`, all the objects are in a packfile; you can identify the big objects by running another plumbing command called `git verify-pack` and sorting on the third field in the output, which is file size.
es: Tras lanzar el comando `git gc`, todos los objetos estarán guardados en un archivo empaquetador. Puedes identifcar los objetos enormes en su interior, utilizando otro comando de fontanería denominado `git verify-pack` y ordenando su salida por su tercera columna, la que nos informa de los tamaños de cada objeto.

source: If you don’t have these files (or you don’t even have a `.ssh` directory), you can create them by running a program called `ssh-keygen`, which is provided with the SSH package on Linux/Mac systems and comes with the MSysGit package on Windows:
es: Si no tienes esos archivos (o no tienes ni siquiera la carpeta '.ssh'), has de crearlos; utilizando un programa llamado 'ssh-keygen', que viene incluido en el paquete SSH de los sistemas Linux/Mac o en el paquete MSysGit en los sistemas Windows:

source: Let’s follow Jessica’s workflow as she works on her two features, collaborating in parallel with two different developers in this environment.
es: Vamos a seguir el trabajo de Jessica, a medida que trabaja en sus dos funcionalidade; colaborando en paralelo con dos desarrolladores distintos.

source: This is nice because with this syntax you can specify more than two references in your query, which you cannot do with the double-dot syntax.
es: Esto nos permite indicar más de dos referencias en una misma consulta. Algo imposible con la sintaxis dos-puntos.

source: This occurs fairly commonly.
es: Es algo que frecuentemente suele ser necesario.

source: You need to be careful to change only the e-mail addresses that are yours, so you use `--commit-filter`:
es: Aunque es necesario ser cuidadoso para actuar solo sobre aquellas direcciones que se deseen cambiar, utilizando para ello la opción `--commit-filter`:

source: To demonstrate, you can use the plumbing command `hash-object`, which takes some data, stores it in your `.git` directory, and gives you back the key the data is stored as.
es: Para verlo en acción, puedes utilizar el comando de fontanería 'hash-object'. Este comando coge ciertos datos, los guarda en la carpeta '.git.' y te devuelve la clave bajo la cual se han guardado.

source: The iss53 branch has moved forward with your work.
es: La rama 'iss53' ha avanzado con tu trabajo.

source: If you’re on a Linux or Mac system that uses LF line endings, then you don’t want Git to automatically convert them when you check out files; however, if a file with CRLF endings accidentally gets introduced, then you may want Git to fix it.
es: Si estás trabajando en una máquina Linux o Mac, entonces no te interesa convertir automáticamente los finales de línea al extraer código. Sino que te interesa arreglar los posibles CRLF que pudieran aparecer accidentalmente.

source: Insert 18333fig0338.png Figure 3-38.
es: Insert 18333fig0338.png Figura 3-38.

source: If you stash some work, leave it there for a while, and continue on the branch from which you stashed the work, you may have a problem reapplying the work.
es: Si se almacena rápidamente (stash) un cierto trabajo, se deja en la pila durante bastante tiempo, y se continua mientras tanto con otros trabajos sobre la misma rama. Es muy posible que se presenten problemas al tratar de reaplicar los cambios guardados tiempo atrás.

source: For instance, if you’re updating the `master` branch and adding an `experiment` branch, the `send-pack` response may look something like this:
es: Por ejemplo, si estás actualizando la rama `master` y añadiendo otra rama `experiment`, la respuesta del proceso `send-pack` será algo así como:

source: To find out what file it is, you’ll use the `rev-list` command, which you used briefly in Chapter 7.
es: Para concretar cual es el archivo, puedes utilizar el comando `rev-list` que ya vimos brevemente en el capítulo 7.

source: The fetch process is a series of GET requests, where the client can assume the layout of the Git repository on the server.
es: El proceso de recuperación (fetch) de datos se limita a una serie de peticiones GET, siendo el cliente quien ha de conocer la estructura del repositorio Git en el servidor.

source: If you try to merge two branches and subsequently have merge conflicts, you can run the command `git mergetool`; it starts P4Merge to let you resolve the conflicts through that GUI tool.
es: Si intentas fusionar (merge) dos ramas y tienes los consabidos conflictos de integración, puedes lanzar el comando 'git mergetool'; lanzará P4Merge para ayudarte a resolver los conflictos por medio de su interfaz gráfica.

source: At some point in your Git journey, you may accidentally lose a commit.
es: En algún momento de tu trabajo con Git, perderás por error una confirmación de cambios.

source: You want to work on this project with your friends, so you’ll have to re-add their public keys.
es: Si deseas compartir el proyecto con tus compañeros, tienes que añadir de nuevo sus claves públicas.

source: You effectively change the order of those commits and remove the "added cat-file" commit completely.
es: De esta forma se habrá cambiado el orden de las dos confirmaciones de cambio, y se habrá eliminado completamente la de "added cat-file".

source: It essentially rewinds the work you’ve done in your testing branch temporarily so you can go in a different direction.
es: Básicamente, lo que se está haciendo es rebobinar el trabajo que habias hecho temporalmente en la rama 'testing'; de tal forma que puedas avanzar en otra dirección diferente.

source: Occasionally, Git automatically runs a command called "auto gc".
es: De cuando en cuando, Git lanza automáticamente un comando llamado "auto gc".

source: If you specify `file://`, Git fires up the processes that it normally uses to transfer data over a network which is generally a lot less efficient method of transferring the data.
es: Si escribes con el prefijo 'file://', Git lanza el proceso que usa habitualmente para transferir datos sobre una red; proceso que suele ser mucho menos eficiente.

source: One nice thing about making Git push over HTTP is that you can use any WebDAV server, without specific Git features; so, you can use this functionality if your web-hosting provider supports WebDAV for writing updates to your web site.
es: La utilidad de habilitar Git para enviar (push) a través de HTTP es la posibilidad de utilizar cualquier servidor WebDAV para ello, sin necesidad de requerimientos específicos para Git. De tal forma que puedes hacerlo incluso a través de tu proveedor de albergue web, si este soporta WebDAV para escribir actualizaciones en tu sitio web.

source: ### Remotes ###
es: ### Remotos ###

source: Jessica wants to tweak something, so she commits again and then pushes this back up to the server:
es: Jessica realiza algunos ajustes, los confirma (commit) y los envia (push) de vuelta al servidor:

source: Notice that the object entry points to the commit SHA-1 value that you tagged.
es: Merece destacar que el inicio del objeto apunta al SHA-1 de la confirmación de cambios recién etiquetada.

source: In Git, these are called "references" or "refs"; you can find the files that contain the SHA-1 values in the `.git/refs` directory.
es: En Git, estp es lo que se conoce como "referencias" o "refs". En la carpeta `.git/refs` puedes encontrar esos archivos con valores SHA-1 y nombres .

source: All the Git commands work independently in the two directories:
es: Todos los comandos Git actuan independientemente en ambas carpetas:

source: Insert 18333fig0328.png Figure 3-28.
es: Insert 18333fig0328.png Figura 3-28.

source: A nice way of quickly getting a sort of changelog of what has been added to your project since your last release or e-mail is to use the `git shortlog` command.
es: Una manera elegante de generar rápidamente una lista con los principales cambios añadidos a tu proyecto desde la anterior versión, es utilizando el comando 'git shortlog'.

source: If this comes back with a list of alternate URLs, Git checks for loose files and packfiles there — this is a nice mechanism for projects that are forks of one another to share objects on disk.
es: En el caso de que esto devolviera una lista de ubicaciones (URL) alternativas, Git busca en ellas. (Es un mecanismo muy adecuado en aquellos proyectos donde hay segmentos derivados uno de otro compartiendo objetos en disco.)

source: Running the handful of required commands gives you a simple way to give the world read access to your Git repository.
es: Simplemente lanzando unos cuantos comandos, dispones de un método sencillo de dar al mundo entero acceso a tu repositorio Git.

source: [remote rejected] master -> master (hook declined) error: failed to push some refs to 'git@gitserver:project.git'
es: [remote rejected] master -> master (hook declined) error: failed to push some refs to 'git@gitserver:project.git'[remote rejected] master -> master (hook declined) error: failed to push some refs to 'git@gitserver:project.git'

source: As you briefly saw in the Chapter 1, you can specify Git configuration settings with the `git config` command.
es: Como se ha visto brevemente en el capítulo 1, podemos acceder a los ajustes de configuración de Git a través del comando 'git config'.

source: Now that you have a remote Git repository set up as a point for all the developers to share their code, and you’re familiar with basic Git commands in a local workflow, you’ll look at how to utilize some of the distributed workflows that Git affords you.
es: Ahora que ya tienes un repositorio Git, configurado como punto de trabajo para compartir código entre desarrolladores. Y ahora que ya conoces los comandos básicos de Git para flujos de trabajo locales. Puedes hechar un vistazo a algunos de los flujos de trabajo distribuidos que Git permite.

source: Before the last commit, you were using closer to 2K — clearly, removing the file from the previous commit didn’t remove it from your history.
es: Antes de la última confirmación de cambios, estabas usando algo así como 2 KB. Resulta claro que esa última confirmación de cambios no ha borrado el archivo enorme del historial.

source: ### Maintenance ###
es: ### Mantenimiento ###

source: That is one of the simplest workflows.
es: Este es uno de los flujos de trabajo más simples.

source: This is much like specifying `git diff --cached` on the command line:
es: Es muy parecido a lanzar el comando 'git diff --cached' directamente en la línea de comandos:

source: You can obviously refer to a commit by the SHA-1 hash that it’s given, but there are more human-friendly ways to refer to commits as well.
es: La forma canónica de referirse a una confirmación de cambios es indicando su código-resumen criptográfico SHA-1. Pero también existen otras maneras más sencillas.

source: Merging a branch to integrate the diverged work history.
es: Fusionando una rama para integrar el registro de trabajos divergentes.

source: To see which stashes you’ve stored, you can use `git stash list`:
es: Para ver el contenido de dicha pila, se emplea el comando 'git stash list':

source: If you want to contribute to an existing project to which you don’t have push access, GitHub encourages forking the project.
es: Si deseas contribuir a un proyecto ya existente, en el que no tengas permisos de envio (push). GitHub recomienda bifurcar el proyecto.

source: You’ll now create a new tree with the second version of test.txt and a new file as well:
es: Vamos a crear un nuevo árbol con la segunda versión del archivo test.txt y con un nuevo archivo.

source: You saw this in the last section with the `iss53` and `hotfix` branches you created.
es: Tal y como has visto con las ramas 'iss53' y 'hotfix' que has creado en la sección anterior.

source: That gives you your next commit object.
es: El siguiente objeto confirmación de cambio (commit).

source: If you want more complex access control type permissions on your repositories, you can handle them with the normal filesystem permissions of the operating system your server runs.
es: En caso de que necesites un control más complejo y fino sobre cada repositorio, puedes manejarlos a través de los permisos estandar del sistema de archivos.

source: You can also edit these patch files to add more information for the e-mail list that you don’t want to show up in the commit message.
es: Puedes incluso editar esos archivos de parche, para añadirles más información , específica para la lista de correo, y que no desees mostrar en el propio mensaje de la confirmación de cambios.

source: Assuming she already has her repository cloned, she decides to work on `featureA` first.
es: Suponiendo que tiene su repositorio ya clonado, ella decide trabajar primero en la funcionalidad A (featureA).

source: Then, your editor will open to something like this for your placeholder commit message when you commit:
es: A partir de entonces, cada vez que confirmes cambios (commit), tu editor se abrirá con algo como esto:

source: ## Interactive Staging ##
es: ## Preparación interactiva ##

source: To disable the ability to force-update remote branches to non-fast-forward references, set `receive.denyNonFastForwards`:
es: Para impedir estos envios forzados de referencias de avance no directo (no fast-forward) a ramas remotas, es para lo que se emplea el parámetro 'receive.denyNonFastForwards':

source: to this:
es: a quedar en algo como:

source: This technique allows you to context-switch quickly and completely — because your work is separated into silos where all the changes in that branch have to do with that topic, it’s easier to see what has happened during code review and such.
es: Esta técnica te posibilita realizar rápidos y completos saltos de contexto. Y, debido a que el trabajo está claramente separado en silos, con todos los cambios de cada tema en su propia rama, te será mucho más sencillo revisar el código y seguir su evolución.

source: Better get rid of it:
es: Mejor si lo quitas:

source: Let’s say the project maintainer has pulled in a bunch of other patches and tried your first branch, but it no longer cleanly merges.
es: Supongamos que el gestor del proyecto ha recuperado e integrado un grupo de otros parches y después lo intenta con tu primer parche, viendo que no se integra limpiamente.

source: When you find the correct user, click the Add button to add that user as a collaborator on your project (see Figure 4-11).
es: Cuando localices al usuario deseado, clica sobre el botón "Add" para añadirlo como colaborador en tu proyecto (ver Figura 4-11).

source: First, you need to set up the imap section in your `~/.gitconfig` file.
es: Lo primero es configurar correctamente el apartado imap de tu archivo `~/.gitconfig`.

source: See the `git config` manpage for all the subsettings you can configure, if you want to do that.
es: Mira en la página man de 'git config' si deseas tener explicaciones más detalladas.
